Autodesk.Revit.DB.Mechanical.DuctSizeSettings.AddSize(Autodesk.Revit.DB.Mechanical.DuctShape,Autodesk.Revit.DB.MEPSize)
Inserts a new MEPSize in to the duct size settings. The duct shape determines the location of the new size in the size table.
shape:
The shape of duct.
sizeInfo:
The new MEPSize to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Throws if there is no size set determined by the duct shape
or  there is already the same size in the size set determined by the duct shape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the function is called during iterating the size set.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettings(Autodesk.Revit.DB.Document)
Get the duct size settings of the project.
aDoc:
The document.
Returns:
The duct size settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.Item(Autodesk.Revit.DB.Mechanical.DuctShape)
Get the DuctSizes for this DuctShape.
ductShape:
The duct shape.
Returns:
The DuctSizes for this DuctShape.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no DuctSizes for this DuctShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012